{
    "fentanyl": "Fentanyl is a powerful synthetic opioid analgesic that is similar to morphine but is 50 to 100 times more potent. It is a prescription drug that is also made and used illegally. Its medical use is to treat severe pain, typically advanced cancer pain.",
    "mushrooms": "Psilocybin mushrooms, commonly known as magic mushrooms or shrooms, are a group of fungi that contain psilocybin, a naturally occurring psychedelic compound. Psilocybin is known for its ability to produce profound changes in consciousness and perception among users.",
    "marijuana": "Marijuana, also known as cannabis, is a psychoactive drug from the Cannabis plant used for medical or recreational purposes. It is known for its psychoactive effects, caused primarily by the compound THC, and is used to treat a variety of medical conditions.",
    "lsd": "LSD, short for lysergic acid diethylamide, is a powerful hallucinogenic drug that alters perception, mood, and a variety of cognitive processes. LSD is known for its psychological effects, which can include altered awareness of surroundings, perceptions, and feelings as well as sensations and images that seem real though they are not.",
    "heroin": "Heroin is an opioid drug made from morphine, a natural substance taken from the seed pod of various opium poppy plants. Heroin can be a white or brown powder, or a black sticky substance known as black tar heroin. It is known for its highly addictive properties and significant risk of overdose and death.",
    "cocaine": "Cocaine is a strong stimulant drug used primarily as a recreational drug. It is commonly snorted, inhaled as smoke, or dissolved and injected into a vein. Mental effects may include loss of contact with reality, an intense feeling of happiness, or agitation.",
    "amphetamine": "Amphetamine is a central nervous system (CNS) stimulant that is used in the treatment of attention deficit hyperactivity disorder (ADHD), narcolepsy, and obesity. Amphetamine is known to increase wakefulness and focus while decreasing fatigue and appetite.",
    "ketamine": "Ketamine is a medication primarily used for starting and maintaining anesthesia. It induces a trance-like state while providing pain relief, sedation, and memory loss. Apart from its medical use, it has been used as a recreational drug for its hallucinogenic and dissociative effects.",
    "mdma": "MDMA, commonly known as ecstasy or molly, is a psychoactive drug primarily used for recreational purposes. The desired effects include altered sensations, increased energy, empathy, as well as pleasure. MDMA is known for its association with the dance and club scene.",
    "methamphetamine": "Methamphetamine is a powerful, highly addictive stimulant that affects the central nervous system. Also known as meth, blue, ice, and crystal, among many other terms, it takes the form of a white, odorless, bitter-tasting crystalline powder. Methamphetamine use can lead to devastating health and social consequences."
}